app/views/static_pages/home.html.erb

		<div class="assistName">
	   		<%= link_to User.find(x[:id]).name, "/players/"+x[:id].to_s, title: "Player Details" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

					<% end %>
						<%= Team.find(team[:id]).name %>
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]