app/controllers/static_pages_controller.rb

  def home
	@team = Team.find(8)
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]

		f=(x[:assists].to_f/x[:gp]).round(2)
		x[:apg] = number_with_precision(f, :precision => 2)
	end
	@assistRankings = @assistRankings.compact.sort_by { |x| [x[:assists],x[:apg],-(User.find(x[:id]).id)] }.reverse
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 101]]

  def schedule
	@schedule = Team.find(8).matches.collect.sort_by { |c| c.played_at }.reverse
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? ORDER BY "teams"."id" ASC LIMIT 1  [["id", "1"]]

  def team
	@players = Team.find(8).users.collect.sort_by { |c| c.id }
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."team_id" = ?  [["team_id", 1]]